app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
    def index
        @admins = Admin.all

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @admin = Admin.find(params[:id])

SELECT "users".* FROM "users"
---
    def manage_users
        @users = User.all