app/controllers/articles_controller.rb

    def index
        @articles = Article.where(user_id: current_user.id)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]