app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Premier"], ["body", "aaaaaaaaaaaaaaaaaaaa"], ["created_at", "2023-06-15 10:38:19.297648"], ["updated_at", "2023-06-15 10:38:19.297648"], ["status", "public"], ["slug", "JPICBFQM"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "bbbbbbbbbbbbbbbbbbbb"], ["updated_at", "2023-06-16 13:26:39.816463"], ["id", 2]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)