app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "Dono"], ["body", "aaaaaaaaaaaaaaaaaaaa"], ["article_id", 15], ["created_at", "2023-06-15 11:06:42.246646"], ["updated_at", "2023-06-15 11:06:42.246646"], ["status", "public"]]
---
    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)