app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "donovan@charles.coco"], ["updated_at", "2023-06-19 12:42:14.812896"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)